Revit 2027 API
BuiltInFailures.GroupFailures.BadViewForAttachedGroup Property
 Attached groups can only be created for view specific elements belonging to non-3d model views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadViewForAttachedGroup { get; }
Public Shared ReadOnly Property BadViewForAttachedGroup As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadViewForAttachedGroup {
	FailureDefinitionId^ get ();
}
static member BadViewForAttachedGroup : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace